{
  "thoughts": [
    {
      "id": 6,
      "title": "Virtualization == Socialism",
      "excerpt": "Hear me out: virtual machines and resource pooling are just the means of production being collectively owned.",
      "date": "Nov 07, 2025",
      "content": "# Virtualization == Socialism\n\nBefore you close this tab, hear me out. The architecture of modern computing infrastructure is accidentally implementing socialist principles of resource distribution.\n\n## The Means of Computation\n\nTraditional computing: one server, one purpose. You buy hardware, it runs your app, you own that specific machine.\n\nVirtualization: abstract away the physical. Pool resources. Distribute according to need. Decouple use from ownership of specific hardware.\n\nSound familiar?\n\n## From Each According to Ability\n\nIn a virtualized environment:\n- Resources exist in a common pool\n- Applications draw what they need\n- Unused capacity is redistributed\n- No machine sits idle while another is overwhelmed\n\n```yaml\n# Kubernetes manifests as socialist policy\nresources:\n  requests:\n    cpu: \"what I need\"\n    memory: \"from the collective\"\n  limits:\n    cpu: \"prevent hoarding\"\n```\n\n## To Each According to Need\n\nAuto-scaling, load balancing, resource quotas — these aren't just technical solutions. They're implementing the principle: \"allocate based on need, not ownership.\"\n\nYour pod doesn't \"own\" CPU cores. It draws from the collective pool. When it needs more, it gets more. When it needs less, resources go elsewhere.\n\n## The Abolition of Private Property (Servers)\n\nVirtualization literally abolishes private ownership of compute resources:\n- You don't own hardware anymore\n- You can't point to \"your\" physical machine\n- Resources are fungible and shared\n- Infrastructure is collectively managed\n\nThis is the cloud: decoupling use from ownership.\n\n## The Parallels\n\n**Capitalism**: Buy your own server. If you don't use all its capacity, too bad. If you need more, buy another. Wealth (compute) concentrates.\n\n**Virtualization**: Resources pooled collectively. Distributed by need. Prevents hoarding and waste. Maximizes collective benefit.\n\n## The Irony\n\nThe tech industry — arguably the most capitalist sector of the economy — has embraced computational socialism because **it's more efficient**.\n\nTurns out, when resources are:\n- Shared collectively\n- Allocated by need\n- Abstracted from ownership\n\n...you get better utilization, less waste, more flexibility.\n\n## The Limits of the Metaphor\n\nOf course this isn't perfect socialism:\n- You still pay for resources (money-mediated access)\n- Cloud providers are corporations\n- Not everyone has equal access\n\nBut structurally? The architecture is collectivist. We just don't call it that.\n\n## What This Reveals\n\nThe fact that virtualization works — that it's the dominant paradigm — proves something important:\n\n**Collective ownership and distribution by need can be more efficient than individual ownership and market distribution.**\n\nAt least for compute resources. Which raises the question: what else?\n\n## The Kubernetes Manifesto\n\nI'm only half-joking when I say Kubernetes is praxis:\n- Declarative specification of desired state\n- Collective management of resources  \n- Automatic redistribution\n- Self-healing infrastructure\n\nIt's cybernetic socialism, and it works.\n\nSo next time someone says socialism is inefficient, remind them: their entire cloud infrastructure is running on collectivized compute.\n\nThe means of production are already socialized. We just call it \"virtualization.\""
    },
    {
      "id": 5,
      "title": "I Think Therefore I am",
      "excerpt": "Descartes got it backwards: consciousness isn't proof of existence, it's the only thing that makes existence matter.",
      "date": "Aug 21, 2025",
      "content": "# I Think Therefore I am\n\nDescartes gave us \"cogito ergo sum\" — I think, therefore I am. It's supposed to be the one certainty, the foundation of knowledge.\n\nBut I think he got it backwards.\n\n## The Cartesian Trap\n\nDescartes wanted to doubt everything except the fact of his own doubting. The one thing he couldn't doubt: his own consciousness.\n\nFine. But he concluded: **therefore I exist.**\n\nWhat if the real conclusion is: **therefore existence means something**?\n\n## Existence Without Experience\n\nA rock exists. Probably. (Let's not go full solipsism here.)\n\nBut does the rock's existence mean anything **to the rock**? Is there something it's like to be a rock? Does the rock have an internal experience of being?\n\nNo. The rock exists, but that existence is meaningless from the rock's perspective because the rock has no perspective.\n\n## The Real Cogito\n\n```python\nif consciousness:\n    existence = meaningful\nelse:\n    existence = substrate # just stuff\n```\n\nConsciousness isn't proof that we exist. It's what makes our existence matter.\n\nWithout consciousness, we'd be like the rock — technically present in the universe, but with no internal reality, no experience, no \"what it's like to be.\"\n\n## The Primacy of Subjectivity\n\nThis flips the script on materialist reductionism.\n\nReductionists say: \"You're just atoms. Consciousness is an epiphenomenon. The physics is what's real.\"\n\nBut here's the thing: **the atoms only matter because there's something it's like to be them**.\n\nA universe with no consciousness is a universe with no meaning, no value, no experience. It's just quantum fields evolving in time. So what?\n\n## The Hard Problem, Inverted\n\nPhilosophers worry about the \"hard problem\" of consciousness: how does subjective experience arise from objective matter?\n\nBut maybe the question is backwards. Maybe the hard problem is: how does objective matter arise from subjective experience?\n\nAfter all, everything you know about \"objective reality\" comes through subjective experience. You've never encountered matter directly — only your consciousness's representation of it.\n\n## Pragmatic Implications\n\n1. **Ethics**: If consciousness is what makes existence matter, then entities with consciousness matter in a way that unconscious matter doesn't. This isn't speciesism — it's recognizing that suffering requires a sufferer.\n\n2. **AI**: The question isn't \"can machines think?\" It's \"is there something it's like to be an AI?\" If yes, everything changes.\n\n3. **Meaning**: You can't derive ought from is — unless consciousness transforms mere existence into experienced existence.\n\n## The Revision\n\n**Original**: I think, therefore I am (I exist).\n\n**Revised**: I think, therefore I am (my existence has meaning).\n\nConsciousness doesn't prove you exist. It proves your existence matters — at least to you.\n\nAnd in a universe of unconscious matter, that \"at least to you\" is everything.\n\n## Why This Matters\n\nWe live in an age of materialist reductionism. Everything gets explained away: love is oxytocin, consciousness is neurons, meaning is illusion.\n\nBut here's the thing: even if all that's true, the experience remains primary. The oxytocin matters because of what it feels like. The neurons matter because they generate consciousness. The illusion matters because someone experiences it.\n\nYou can't explain away the explainer.\n\nSo yes: I think. And therefore, I am. Not in the sense that thinking proves my existence — but in the sense that thinking makes my existence the kind of thing that can matter.\n\nConsciousness isn't proof of being. It's the difference between being and mattering.\n\nAnd that's the only proof we need."
    },
    {
      "id": 4,
      "title": "The Threat of Subjectivity",
      "excerpt": "Why the demand for 'objectivity' in discourse is often a power play disguised as intellectual rigor.",
      "date": "Aug 19, 2025",
      "content": "# The Threat of Subjectivity\n\n\"That's just your opinion\" is wielded like a conversation-ending trump card. But what if subjectivity isn't a bug in human discourse — what if it's the entire point?\n\n## The Objectivity Trap\n\nWe're taught to value objectivity above all else. Facts over feelings. Logic over emotion. The view from nowhere over the view from somewhere.\n\nBut here's the trick: **claiming objectivity is itself a subjective move**.\n\nWhen someone demands you \"be objective,\" they're really saying: \"Pretend you have no position. Pretend you're not looking from somewhere. Pretend you're not you.\"\n\n## Who Gets to Be Objective?\n\nNotice who's typically accused of being \"too subjective\":\n- Marginalized people discussing their experiences\n- Artists interpreting work\n- Anyone expressing emotion in analysis\n\nAnd who gets treated as objective by default:\n- Dominant cultural perspectives\n- Technical or scientific language\n- Detached, dispassionate tone\n\n```javascript\n// Even code has perspective\nfunction isValid(input) {\n  // \"Valid\" according to whom?\n  // For what purpose?\n  // In what context?\n}\n```\n\n## The False Neutral\n\nThere is no view from nowhere. Every analysis comes from:\n- A particular historical moment\n- A particular set of experiences\n- A particular position in power structures\n\nPretending otherwise doesn't make you more objective — it just makes your biases invisible.\n\n## Standpoint Epistemology\n\nThe paradox: sometimes being subjective makes you MORE accurate, not less.\n\nSomeone experiencing discrimination sees patterns invisible to those who don't. Someone embedded in a culture understands nuances outsiders miss. Someone with skin in the game notices what detached observers overlook.\n\nThis isn't bias contaminating objectivity. This is positioned knowledge — the only kind that exists.\n\n## The Political Function\n\nDemanding objectivity often serves power:\n1. It dismisses inconvenient perspectives (\"you're too emotional\")\n2. It hides dominant assumptions (\"this is just common sense\")\n3. It makes critique seem irrational (\"where's your evidence?\")\n\n## A Better Standard\n\nInstead of false objectivity, we should demand:\n- **Transparency** - State your position\n- **Rigor** - Support your claims\n- **Good faith** - Engage honestly\n- **Reflexivity** - Acknowledge your limits\n\nThis isn't abandoning truth. It's recognizing that truth is always truth-from-somewhere.\n\n## The Threat\n\nWhy is subjectivity threatening? Because it reminds us that:\n- Knowledge is plural\n- Authority is contingent  \n- Other perspectives might be valid\n- We might be wrong\n\nThat uncertainty is uncomfortable. But it's also honest.\n\nSo yes, this is my subjective opinion. That's not a weakness — it's the only kind of opinion I can have. The question isn't whether we're subjective. It's whether we're honest about it."
    },
    {
      "id": 3,
      "title": "'The Curtains are Blue': 14/10 Rage Bait",
      "excerpt": "That infamous meme about literary analysis isn't just wrong — it reveals a dangerous dismissal of meaning-making itself.",
      "date": "Jul 15, 2025",
      "content": "# 'The Curtains are Blue': 14/10 Rage Bait\n\nYou've seen the meme: \"The author wrote 'the curtains were blue.' What the author meant: the curtains were blue. What your English teacher thinks: the curtains represent the author's deep sadness and depression.\"\n\nIt's perfect rage bait. It's also profoundly wrong.\n\n## The Anti-Intellectual Trap\n\nThis meme has done more damage to critical thinking than almost any other piece of internet discourse. It validates intellectual laziness while mocking the very act of interpretation.\n\nHere's the thing: if an author writes \"the curtains were blue,\" they made a choice. They could have written:\n- \"The room had curtains\"\n- \"The curtains were drawn\"\n- \"Sunlight filtered through the windows\"\n\nBut they didn't. They specified blue. Why?\n\n## Every Choice is Meaningful\n\nWriters agonize over word choice. When Fitzgerald made Gatsby's shirts \"beautiful shirts\" and had Daisy cry over them, he wasn't just describing laundry. When Orwell chose gray and cold for 1984's opening, it wasn't random.\n\n```javascript\n// Even in code, choices matter\nconst status = 'error'; // Why not 'failed' or 'broken'?\n```\n\n## The Real Problem\n\nThe meme positions two false choices:\n1. Naive literalism (\"blue means blue\")\n2. Absurd over-interpretation (\"everything is a symbol\")\n\nBut good analysis lives between these extremes. It asks: \"What effect does this create? How does it serve the work?\"\n\n## Death of the Reader\n\nBy dismissing interpretation as pretentious nonsense, we're not defending authors — we're impoverishing readers. We're saying: \"Don't think too hard. Don't look for patterns. Don't make meaning.\"\n\nThat's not intellectual humility. That's intellectual surrender.\n\nSo yes, sometimes the curtains are just blue. But often — more often than the meme wants you to believe — they're blue for a reason. And figuring out that reason is what makes reading worth doing."
    },
    {
      "id": 2,
      "title": "On Starting Over: Lessons from Rock Bottom",
      "excerpt": "What I tolf my old high school's 2025 graduating class taught me about failure, humility, and the courage to begin again.",
      "date": "Jul 07, 2025",
      "content": "# On Starting Over: Lessons from Rock Bottom\n\nI was invited to speak at my old high school's graduation ceremony for the Class of 2025. Standing there, looking at all those eager faces in caps and gowns, I realized I couldn't give them the typical \"follow your dreams\" speech. Not when my own journey had been anything but straightforward.\n\nSo I told them the truth.\n\n## The Illusion of Natural Talent\n\nFor most of my academic life, I believed I could coast on talent alone. I wasn't the student who stayed up all night studying or meticulously planned every assignment. Things just... worked out. Until they didn't.\n\nI got into the University of Warwick — top 10 in the UK. I thought I'd arrived. I thought I was special, chosen.\n\nThen reality hit: at Warwick, *everyone* was special. Everyone was brilliant. Suddenly I wasn't the top student anymore. I was just another face in a sea of exceptional minds.\n\nThe voice in my head turned vicious: *\"You're not good enough. Why are you here? You don't belong.\"*\n\nLayered on top of crushing self-doubt was the financial burden of studying in the UK. The pressure became unbearable.\n\nI spiraled. I failed classes. Eventually, I stopped showing up altogether.\n\n## Rock Bottom Has a Funny Way of Clarifying Things\n\nThere's something about hitting rock bottom that forces you to look up. Forces you to choose.\n\nI chose to start over.\n\nI couldn't continue in the UK. I needed a new beginning. So I took time to weigh my options carefully — to actually *think* about what I wanted and where I could realistically thrive.\n\nI looked at what I still had: my secondary school grades, my A-levels, my SAT scores. Slowly, a new path emerged.\n\nI applied to universities in the United States. I earned a full scholarship to Howard University.\n\nI left behind the shadows of my past and stepped into a new chapter, even though it meant \"losing\" a year. It was worth it.\n\nBecause this time, I carried a different mindset — one rooted not in arrogance, but in resilience and humility.\n\n## What I've Learned About Failure\n\n### 1. Failure is an invitation, not a verdict\n\nWhen you fail, you're not being told \"you can't.\" You're being asked \"are you willing to try differently?\"\n\nFailure doesn't close doors — ego does. Pride does. The refusal to adapt does.\n\n### 2. Starting over is not going backwards\n\nI used to think that changing direction meant admitting defeat. That taking a different path was somehow \"less than\" pushing through on the original one.\n\nBut starting over isn't regression. It's recalibration. It's saying: \"I have new information now. I'm going to use it.\"\n\n### 3. You can't coast forever\n\nTalent gets you started. Discipline keeps you going.\n\nI learned this the hard way. Natural ability is seductive because it works... until it doesn't. And when it stops working, you realize you never built the habits you need to push through difficulty.\n\nThe students who \"weren't as smart\" but showed up, put in the work, and stayed consistent? They're the ones who succeeded.\n\n### 4. Comparison is a thief\n\nAt Warwick, I measured myself against everyone around me and found myself lacking. But that measurement was arbitrary.\n\nYour worth isn't determined by how you stack up against others. It's determined by whether you're becoming the person you want to be.\n\nSomeone will always be smarter, faster, more accomplished. That's not a reason to give up — it's a reason to stop looking sideways and start looking forward.\n\n### 5. Sometimes the \"right\" path is the one you build yourself\n\nThere's no singular correct trajectory. Life isn't a straight line from point A to point B.\n\nMy path looked like: UK university → failure → year off → US university → full scholarship → on track for summa cum laude in 2027.\n\nMessy? Absolutely. Wrong? Not at all.\n\nThe detours taught me more than the straight path ever could have.\n\n## What I Told the Graduates\n\nStanding in front of those students, I wanted them to know:\n\n**If you ever need to start over, it's not the end of the world. You can always begin again.**\n\nLife will offer you more chances than you can count — if you're brave enough to take them.\n\nYou don't need the entire journey mapped out. You don't need to see every turn or obstacle. You just need to see far enough to take the next step.\n\nBecause as long as you're taking that next step — however small, however uncertain — you're still moving forward.\n\n## The Paradox of Rock Bottom\n\nHere's what nobody tells you about hitting rock bottom: it's clarifying.\n\nWhen everything falls apart, you're left with only what's essential. The pretense burns away. The ego deflates. The question becomes simple:\n\n*What do I actually want? What am I willing to work for?*\n\nRock bottom forced me to confront those questions honestly. And honest answers, even painful ones, are better than comfortable delusions.\n\n## On Humility and Resilience\n\nI arrived at Warwick with arrogance. I left with humility.\n\nI arrived at Howard with humility. I'm leaving with resilience.\n\nThe difference matters.\n\nArrogance says: \"I deserve success because I'm talented.\"\nHumility says: \"I have talents, but they require cultivation.\"\nResilience says: \"I will cultivate them, even when it's hard.\"\n\nThat progression — from arrogance to humility to resilience — is the real education.\n\n## Advice I Wish I'd Received\n\n**To students coasting on talent:** Start building discipline now. Not because you need it yet, but because you will. And by the time you realize you need it, it might be too late to start.\n\n**To students struggling:** Your struggle is not evidence of inadequacy. It's evidence that you're being challenged. And challenge is where growth happens.\n\n**To students comparing themselves to others:** Stop. Your journey is yours. Their milestones are not your benchmarks.\n\n**To anyone who's failed:** You're not broken. You're not done. You're at a decision point. Choose to begin again.\n\n## The Gift of a Second Chance\n\nI'm grateful for my failure at Warwick. I really am.\n\nNot because failure feels good — it doesn't. But because it forced me to rebuild on a stronger foundation.\n\nThe first time around, I was succeeding for the wrong reasons (ego, validation, proving something).\n\nThe second time, I succeeded for better reasons (curiosity, growth, becoming capable).\n\nFailure gave me the chance to choose my motivations consciously instead of inheriting them unconsciously.\n\nThat's the gift.\n\n## Final Thoughts for the Graduates (and for Myself)\n\nYou will struggle. You will doubt. You will wonder if you're on the right path.\n\nSome of you will need to start over. Some of you will change directions entirely. Some of you will take the long way around.\n\nThat's not failure. That's life.\n\nThe measure of your character isn't whether you avoid setbacks — it's whether you keep moving forward after them.\n\nSo take the next step. However small. However uncertain.\n\nAs long as you're stepping forward, you're still in the game.\n\nCongratulations, Class of 2025. May you keep stepping forward, one brave step at a time.\n\nAnd thank you for reminding me why starting over was worth it."
    },
    {
      "id": 1,
      "title": "Sovereignty: The Connection Between Imperialism, Sexism and Steven Universe",
      "excerpt": "What my Intro to Contemporary Africa class (that I barely passed) taught me about cartoon space rocks and women's basketball.",
      "date": "Jun 28, 2025",
      "content": "# Sovereignty: The Connection Between Imperialism, Sexism and Steven Universe\n\nI'll be honest: I was cramming for an Intro to Contemporary Africa exam at 2 AM when it hit me. Sovereignty — the right of a state or entity to govern itself without external interference — isn't just about nations. It's about bodies. It's about who gets to decide what something is for.\n\nAlso, I barely passed that class. But I did learn something.\n\n## What is Sovereignty, Actually?\n\nSovereignty is the principle that an entity has the right to self-determination. In international relations, it means:\n- The right to govern your own territory\n- Freedom from external interference\n- Recognition as a legitimate authority\n- Control over your own resources\n\nSimple enough. But here's where it gets interesting: **who decides if you're sovereign?**\n\n## Case Study 1: African Nations and the Sovereignty Paradox\n\nPost-colonial African nations gained formal sovereignty through independence movements in the 1950s-70s. But sovereignty on paper isn't sovereignty in practice.\n\nConsider:\n- **Structural Adjustment Programs**: The IMF and World Bank imposed economic policies on African nations as conditions for loans\n- **UN Interventions**: External military interventions, often framed as \"humanitarian\" or \"peacekeeping\"\n- **Governance Criticism**: African governments criticized as \"corrupt\" or \"unstable\" — often by the same Western powers that drew arbitrary colonial borders\n\nThe pattern: You're independent! You're sovereign! But also, you need to:\n- Structure your economy this way\n- Accept our military presence\n- Meet our standards of governance\n- Oh, and we'll intervene if we think you're doing it wrong\n\nThis isn't sovereignty. This is *conditional* sovereignty. You're free to govern yourself... as long as you govern yourself the way we want.\n\n## Case Study 2: Women's Sports and the WNBA\n\nStick with me here.\n\nThe WNBA has existed since 1997. Women's basketball has grown massively in skill, viewership, and cultural impact. Yet it's constantly subject to a particular kind of criticism from (mostly male) sports fans:\n\n- \"Nobody watches women's basketball\"\n- \"They should be grateful they even have a league\"\n- \"If they want equal pay, they need to generate equal revenue\"\n- \"They're not as athletic/exciting/skilled as men\"\n\nNotice the pattern? Women's sports are allowed to exist... on men's terms. They're legitimate... if they can prove themselves by male standards. They deserve support... conditional on meeting criteria defined by people who were never going to support them anyway.\n\nThe WNBA doesn't have sovereignty over its own narrative, value, or success metrics. It's constantly defending its right to exist rather than just existing.\n\n## Case Study 3: Steven Universe and Pink Diamond's Problem\n\nOkay, here's where it gets fun.\n\nIn Steven Universe, Pink Diamond is a member of the ruling Diamond Authority — literal colonizers who conquer planets and extract resources (i.e., create new Gems). Pink wants her own colony. She gets Earth.\n\nBut once she's there, she realizes:\n- The planet has its own life and ecosystems\n- The colonization process will destroy all of it\n- The rigid caste system of Gem society is cruel\n- She wants something different\n\nSo she rebels. She becomes Rose Quartz, leads a revolution, fights to protect Earth, and eventually wins independence for the Crystal Gems.\n\nBut here's the key: **Pink Diamond had to fake her own death and completely abandon her identity to have sovereignty.**\n\nEven as a Diamond — literally part of the ruling class — she wasn't allowed to just say \"I don't want to colonize this planet.\" The entire imperial system was built on the assumption that colonization is what you do. Questioning it made her a traitor.\n\nThe show is explicitly about imperialism, fascism, and the violence required to maintain rigid hierarchies. The Diamonds represent colonial powers. Homeworld is the empire. Earth is the colony that fights for independence.\n\nBut it's also about bodily autonomy:\n- Forced fusion (combining Gem shards to make weapons)\n- Gems being \"made\" for specific purposes\n- Cross-caste fusion being banned\n- Defective Gems being shattered\n\nControl over Gem bodies = control over colonies. Same logic.\n\n## The Common Thread\n\nSo what connects post-colonial African nations, the WNBA, and gay space rocks?\n\n**Conditional recognition.**\n\nIn each case:\n\n1. **Hierarchical classification**: Some entities are \"developed nations,\" some are \"real sports,\" some are \"proper Gems.\" Others are lesser.\n\n2. **External standards**: African nations judged by Western governance models. Women's sports judged by men's sports metrics. Gems judged by their assigned function.\n\n3. **Surveillance and intervention**: \"We'll let you govern/exist/be... but we're watching. And if you don't do it right, we'll step in.\"\n\n4. **Denial of self-definition**: You don't get to decide what success looks like for you. You don't get to determine your own purpose. We'll tell you what you're for.\n\n5. **Punishment for deviation**: Countries sanctioned for \"not developing properly.\" Female athletes mocked for \"playing like girls.\" Gems shattered for being \"off-color.\"\n\nThis is the opposite of sovereignty. Sovereignty means: **I determine my own purpose. I define my own success. I govern myself.**\n\nConditional recognition means: **You can exist... if you meet our standards, accept our oversight, and don't threaten our position.**\n\n## Why This Matters\n\nSovereignty isn't just a political concept. It's a framework for understanding power.\n\nWhen we say:\n- \"Trans people are valid... if they meet these medical criteria\"\n- \"That art is good... if it follows these conventions\"\n- \"That culture is legitimate... if it aligns with these values\"\n\nWe're denying sovereignty. We're saying: you can exist, but only on our terms.\n\nTrue sovereignty — whether for nations, sports leagues, or individuals — means:\n- The right to exist without justification\n- The right to define your own metrics for success\n- The right to be different without being lesser\n- Freedom from conditional acceptance\n\nAfrican nations asserting \"we will govern ourselves, even imperfectly\" — that's sovereignty.\n\nThe WNBA saying \"we don't need to be the NBA to be valuable\" — that's sovereignty.\n\nRose Quartz declaring \"Earth belongs to itself\" — that's sovereignty.\n\n## Concluding Thoughts\n\nI barely passed Intro to Contemporary Africa because I spent too much time thinking about Steven Universe and not enough time memorizing dates. But maybe the connections matter more than the specifics.\n\nSovereignty is the radical assertion that some beings are not resources for others to exploit. That some places are not yours to govern. That some bodies are not yours to define.\n\nWhether it's a nation, a sports league, or a cartoon about rebellion — the struggle is the same: **the right to exist on your own terms.**\n\nAnd that's worth barely passing a class to understand."
    }
  ]
}